#### Terraform Plan
```
module.ses.aws_ses_email_identity.feedback: Refreshing state... [id=oshrats@gmail.com]
module.s3_cloudfront.aws_cloudfront_origin_access_control.frontend: Refreshing state... [id=EZL1GR0AY9GEK]
module.agent_lambda.aws_iam_role.lambda: Refreshing state... [id=trip-assistant-agent-dev-role]
module.ecr.aws_ecr_repository.agent: Refreshing state... [id=trip-assistant-agent]
module.ssm.aws_ssm_parameter.openai_api_key: Refreshing state... [id=/trip-assistant/dev/openai-api-key]
module.github_oidc.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::727864369235:oidc-provider/token.actions.githubusercontent.com]
module.feedback_dynamodb.aws_dynamodb_table.feedback: Refreshing state... [id=trip-assistant-feedback-dev]
module.ecr.aws_ecr_repository.api: Refreshing state... [id=trip-assistant-api]
module.api_lambda.aws_iam_role.lambda: Refreshing state... [id=trip-assistant-api-dev-role]
module.s3_cloudfront.aws_s3_bucket.frontend: Refreshing state... [id=trip-assistant-frontend-dev]
module.cognito.aws_cognito_user_pool.main: Refreshing state... [id=us-east-2_JjUEYijkz]
module.github_oidc.aws_iam_role.github_actions: Refreshing state... [id=trip-assistant-github-actions-dev]
module.ecr.aws_ecr_lifecycle_policy.api: Refreshing state... [id=trip-assistant-api]
module.ecr.aws_ecr_lifecycle_policy.agent: Refreshing state... [id=trip-assistant-agent]
module.agent_lambda.aws_iam_role_policy.ssm_read: Refreshing state... [id=trip-assistant-agent-dev-role:trip-assistant-agent-dev-ssm]
module.agent_lambda.aws_iam_role_policy_attachment.lambda_basic: Refreshing state... [id=trip-assistant-agent-dev-role-20260214103246950000000002]
module.agent_lambda.aws_lambda_function.agent: Refreshing state... [id=trip-assistant-agent]
module.api_lambda.aws_iam_role_policy.feedback_ses: Refreshing state... [id=trip-assistant-api-dev-role:trip-assistant-api-dev-feedback-ses]
module.api_lambda.aws_iam_role_policy_attachment.lambda_basic: Refreshing state... [id=trip-assistant-api-dev-role-20260214103246950000000001]
module.api_lambda.aws_iam_role_policy.feedback_dynamodb: Refreshing state... [id=trip-assistant-api-dev-role:trip-assistant-api-dev-feedback-dynamodb]
module.cognito.aws_cognito_user_pool_domain.main: Refreshing state... [id=trip-assistant-auth-dev]
module.cognito.aws_cognito_identity_provider.google: Refreshing state... [id=us-east-2_JjUEYijkz:Google]
module.cognito.aws_cognito_resource_server.api: Refreshing state... [id=us-east-2_JjUEYijkz|trip-assistant-api]
module.cognito.aws_cognito_user_pool_client.smoke_test: Refreshing state... [id=7on2rcs70k33prfrnu7btuqfut]
module.github_oidc.aws_iam_role_policy.ecr_push: Refreshing state... [id=trip-assistant-github-actions-dev:trip-assistant-ecr-push-dev]
module.github_oidc.aws_iam_role_policy.terraform: Refreshing state... [id=trip-assistant-github-actions-dev:trip-assistant-terraform-dev]
module.agent_lambda.aws_cloudwatch_log_group.agent: Refreshing state... [id=/aws/lambda/trip-assistant-agent]
module.agent_lambda.aws_lambda_alias.env: Refreshing state... [id=arn:aws:lambda:us-east-2:727864369235:function:trip-assistant-agent:dev]
module.api_lambda.aws_iam_role_policy.invoke_agent: Refreshing state... [id=trip-assistant-api-dev-role:trip-assistant-api-dev-invoke-agent]
module.s3_cloudfront.aws_s3_bucket_public_access_block.frontend: Refreshing state... [id=trip-assistant-frontend-dev]
module.s3_cloudfront.aws_s3_bucket_server_side_encryption_configuration.frontend: Refreshing state... [id=trip-assistant-frontend-dev]
module.github_oidc.aws_iam_role_policy.frontend_deploy: Refreshing state... [id=trip-assistant-github-actions-dev:trip-assistant-frontend-deploy-dev]
module.s3_cloudfront.aws_cloudfront_distribution.frontend: Refreshing state... [id=E8DTLPIKKKCQ0]
module.s3_cloudfront.aws_s3_bucket_policy.frontend: Refreshing state... [id=trip-assistant-frontend-dev]
module.api_gateway.aws_apigatewayv2_api.api: Refreshing state... [id=takhous4qh]
module.cognito.aws_cognito_user_pool_client.frontend: Refreshing state... [id=1qs5jpj6omcg926mg3fdmcsbpv]
module.api_lambda.aws_lambda_function.api: Refreshing state... [id=trip-assistant-api]
module.api_gateway.aws_apigatewayv2_authorizer.cognito: Refreshing state... [id=071ui4]
module.api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.api_lambda.aws_lambda_alias.env: Refreshing state... [id=arn:aws:lambda:us-east-2:727864369235:function:trip-assistant-api:dev]
module.api_lambda.aws_cloudwatch_log_group.api: Refreshing state... [id=/aws/lambda/trip-assistant-api]
module.github_oidc.aws_iam_role_policy.lambda_deploy: Refreshing state... [id=trip-assistant-github-actions-dev:trip-assistant-lambda-deploy-dev]
module.api_gateway.aws_lambda_permission.api_gateway: Refreshing state... [id=AllowAPIGatewayInvoke]
module.api_gateway.aws_apigatewayv2_integration.lambda: Refreshing state... [id=axdty2l]
module.api_gateway.aws_apigatewayv2_route.post: Refreshing state... [id=dv4lumi]
module.api_gateway.aws_apigatewayv2_route.health: Refreshing state... [id=hkktkfk]
module.api_gateway.aws_apigatewayv2_route.post_feedback: Refreshing state... [id=qqsl3qg]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.api_lambda.aws_lambda_function.api will be updated in-place
  ~ resource "aws_lambda_function" "api" {
        id                             = "trip-assistant-api"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:727864369235:function:trip-assistant-api:23" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:727864369235:function:trip-assistant-api:23/invocations" -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "Project"     = "trip-assistant"
        }
      ~ version                        = "23" -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "FEEDBACK_EMAIL"                 = "oshrats@gmail.com" -> "placeholder-for-plan"
                # (6 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.cognito.aws_cognito_identity_provider.google will be updated in-place
  ~ resource "aws_cognito_identity_provider" "google" {
        id                = "us-east-2_JjUEYijkz:Google"
      ~ provider_details  = {
          ~ "client_id"                     = (sensitive value)
          ~ "client_secret"                 = (sensitive value)
            # (7 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.ses.aws_ses_email_identity.feedback must be replaced
-/+ resource "aws_ses_email_identity" "feedback" {
      ~ arn   = "arn:aws:ses:us-east-2:727864369235:identity/oshrats@gmail.com" -> (known after apply)
      ~ email = "oshrats@gmail.com" -> "placeholder-for-plan" # forces replacement
      ~ id    = "oshrats@gmail.com" -> (known after apply)
    }

  # module.ssm.aws_ssm_parameter.openai_api_key will be updated in-place
  ~ resource "aws_ssm_parameter" "openai_api_key" {
        id              = "/trip-assistant/dev/openai-api-key"
      + insecure_value  = (known after apply)
        name            = "/trip-assistant/dev/openai-api-key"
        tags            = {
            "Environment" = "dev"
            "Project"     = "trip-assistant"
        }
      ~ value           = (sensitive value)
      ~ version         = 7 -> (known after apply)
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
*Triggered by @OsherKoren on `feature/infra`*